openFoam/square/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          125;
        startFace       42150;
    }
    outlet
    {
        type            patch;
        nFaces          125;
        startFace       42275;
    }
    side
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350;
        startFace       42400;
    }
    square
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       42750;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          42500;
        startFace       42850;
    }
)

// ************************************************************************* //
