openFoam/square/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: plus |
| \\ / A nd | Web: www.OpenFOAM.com |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
(0 0 0) //0 vertex number
(0.5 0 0)//1
(0.6 0 0)//2
(1.5 0 0)//3
(1.5 0.5 0)//4
(1.5 0.6 0)//5
(1.5 1.1 0)//6
(0.6 1.1 0)//7
(0.5 1.1 0)//8
(0.0 1.1 0)//9
(0.0 0.6 0)//10
(0.0 0.5 0)//11
(0.5 0.5 0)//12
(0.6 0.5 0)//13
(0.6 0.6 0)//14
(0.5 0.6 0)//15

(0 0 0.05) //16
(0.5 0 0.05)//17
(0.6 0 0.05)//18
(1.5 0 0.05)//19
(1.5 0.5 0.05)//20
(1.5 0.6 0.05)//21
(1.5 1.1 0.05)//22
(0.6 1.1 0.05)//23
(0.5 1.1 0.05)//24
(0.0 1.1 0.05)//25
(0.0 0.6 0.05)//26
(0.0 0.5 0.05)//27
(0.5 0.5 0.05)//28
(0.6 0.5 0.05)//29
(0.6 0.6 0.05)//30
(0.5 0.6 0.05)//31
);

blocks
(
hex (0 1 12 11 16 17 28 27) (50 50 1) simpleGrading (0.2 0.2 1)
hex (1 2 13 12 17 18 29 28) (25 50 1) simpleGrading (1 0.2 1)
hex (2 3 4 13 18 19 20 29) (100 50 1) simpleGrading (5 0.2 1)
hex (11 12 15 10 27 28 31 26) (50 25 1) simpleGrading (0.2 1 1)
hex (13 4 5 14 29 20 21 30) (100 25 1) simpleGrading (5 1 1)
hex (10 15 8 9 26 31 24 25) (50 50 1) simpleGrading (0.2 5 1)
hex (15 14 7 8 31 30 23 24) (25 50 1) simpleGrading (1 5 1)
hex (14 5 6 7 30 21 22 23) (100 50 1) simpleGrading (5 5 1)
);

edges
(
);

boundary
(
inlet
{
type patch;
faces
(
(0 11 27 16)
(11 10 26 27)
(10 9 25 26)
);
}

outlet
{
type patch;
faces
(
(3 4 20 19)
(4 5 21 20)
(5 6 22 21)
);
}

side
{
type wall;
faces
(
(8 9 25 24)
(7 8 24 23)
(6 7 23 22)
(0 1 17 16)
(1 2 18 17)
(2 3 19 18)
);
}

square
{
type wall;
faces
(
(12 15 31 28)
(12 13 29 28)
(13 14 30 29)
(14 15 31 30)
);
}

frontAndBack
{
type empty;
faces
(
(0 1 12 11)
(1 2 13 12)
(2 3 4 13)
(11 12 15 10)
(13 4 5 14)
(10 15 8 9)
(15 14 7 8)
(14 5 6 7)
(16 17 28 27)
(17 18 29 28)
(18 19 20 29)
(27 28 31 26)
(29 20 21 30)
(26 31 24 25)
(31 30 23 24)
(30 21 22 23)
);
}
);

mergePatchPairs
(
);

// ************************************************************************* //
