openFoam/square/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-8;
        smoother         GaussSeidel;

    }

    pFinal
    {
        $p;
        tolerance      1e-8;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance          1e-07;
    }
}

PIMPLE
{
    nOuterCorrectors    5;
    nNonOrthogonalCorrectors 0;
    nCorrectors         1;
}


// ************************************************************************* //
